MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX230F128L.PIC
      <edc:SFRDef edc:_addr="0x1F886420" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="PORTE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="PORTE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE8" edc:desc="" edc:mask="0x1" edc:name="RE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE9" edc:desc="" edc:mask="0x1" edc:name="RE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886430" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="LATE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="LATE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE2" edc:desc="" edc:mask="0x1" edc:name="LATE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE3" edc:desc="" edc:mask="0x1" edc:name="LATE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE4" edc:desc="" edc:mask="0x1" edc:name="LATE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE5" edc:desc="" edc:mask="0x1" edc:name="LATE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE6" edc:desc="" edc:mask="0x1" edc:name="LATE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE7" edc:desc="" edc:mask="0x1" edc:name="LATE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE8" edc:desc="" edc:mask="0x1" edc:name="LATE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE9" edc:desc="" edc:mask="0x1" edc:name="LATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886440" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="ODCE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="ODCE" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCE0" edc:desc="" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE1" edc:desc="" edc:mask="0x1" edc:name="ODCE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE2" edc:desc="" edc:mask="0x1" edc:name="ODCE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE3" edc:desc="" edc:mask="0x1" edc:name="ODCE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE4" edc:desc="" edc:mask="0x1" edc:name="ODCE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE5" edc:desc="" edc:mask="0x1" edc:name="ODCE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE6" edc:desc="" edc:mask="0x1" edc:name="ODCE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE7" edc:desc="" edc:mask="0x1" edc:name="ODCE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE8" edc:desc="" edc:mask="0x1" edc:name="ODCE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE9" edc:desc="" edc:mask="0x1" edc:name="ODCE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886450" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPUE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUE0" edc:desc="" edc:mask="0x1" edc:name="CNPUE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE1" edc:desc="" edc:mask="0x1" edc:name="CNPUE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE2" edc:desc="" edc:mask="0x1" edc:name="CNPUE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE3" edc:desc="" edc:mask="0x1" edc:name="CNPUE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE4" edc:desc="" edc:mask="0x1" edc:name="CNPUE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE5" edc:desc="" edc:mask="0x1" edc:name="CNPUE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE6" edc:desc="" edc:mask="0x1" edc:name="CNPUE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE7" edc:desc="" edc:mask="0x1" edc:name="CNPUE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE8" edc:desc="" edc:mask="0x1" edc:name="CNPUE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE9" edc:desc="" edc:mask="0x1" edc:name="CNPUE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886460" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPDE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNPDE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDE0" edc:desc="" edc:mask="0x1" edc:name="CNPDE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE1" edc:desc="" edc:mask="0x1" edc:name="CNPDE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE2" edc:desc="" edc:mask="0x1" edc:name="CNPDE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE3" edc:desc="" edc:mask="0x1" edc:name="CNPDE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE4" edc:desc="" edc:mask="0x1" edc:name="CNPDE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE5" edc:desc="" edc:mask="0x1" edc:name="CNPDE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE6" edc:desc="" edc:mask="0x1" edc:name="CNPDE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE7" edc:desc="" edc:mask="0x1" edc:name="CNPDE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE8" edc:desc="" edc:mask="0x1" edc:name="CNPDE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE9" edc:desc="" edc:mask="0x1" edc:name="CNPDE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886470" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------n-n-------------" edc:cname="CNCONE" edc:desc="" edc:grp="PORTE" edc:impl="0xffffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000-00000000000000" edc:name="CNCONE" edc:nzwidth="0x20" edc:por="00000000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886480" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNENE" edc:desc="" edc:grp="PORTE" edc:impl="0xffc003ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------------xxxxxxxxxx" edc:name="CNENE" edc:nzwidth="0x20" edc:por="0000000000------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEE0" edc:desc="" edc:mask="0x1" edc:name="CNIEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE1" edc:desc="" edc:mask="0x1" edc:name="CNIEE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE2" edc:desc="" edc:mask="0x1" edc:name="CNIEE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE3" edc:desc="" edc:mask="0x1" edc:name="CNIEE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE4" edc:desc="" edc:mask="0x1" edc:name="CNIEE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE5" edc:desc="" edc:mask="0x1" edc:name="CNIEE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE6" edc:desc="" edc:mask="0x1" edc:name="CNIEE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE7" edc:desc="" edc:mask="0x1" edc:name="CNIEE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE8" edc:desc="" edc:mask="0x1" edc:name="CNIEE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE9" edc:desc="" edc:mask="0x1" edc:name="CNIEE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886490" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNSTATE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNSTATE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATE0" edc:desc="" edc:mask="0x1" edc:name="CNSTATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE1" edc:desc="" edc:mask="0x1" edc:name="CNSTATE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE2" edc:desc="" edc:mask="0x1" edc:name="CNSTATE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE3" edc:desc="" edc:mask="0x1" edc:name="CNSTATE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE4" edc:desc="" edc:mask="0x1" edc:name="CNSTATE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE5" edc:desc="" edc:mask="0x1" edc:name="CNSTATE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE6" edc:desc="" edc:mask="0x1" edc:name="CNSTATE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE7" edc:desc="" edc:mask="0x1" edc:name="CNSTATE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE8" edc:desc="" edc:mask="0x1" edc:name="CNSTATE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE9" edc:desc="" edc:mask="0x1" edc:name="CNSTATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8864A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886500" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="------------------nn---n-----nnn" edc:cname="ANSELF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff3107" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx---x-----xxx" edc:name="ANSELF" edc:nzwidth="0x20" edc:por="------------------xx---x-----xxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSF0" edc:desc="" edc:mask="0x1" edc:name="ANSF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSF1" edc:desc="" edc:mask="0x1" edc:name="ANSF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSF2" edc:desc="" edc:mask="0x1" edc:name="ANSF2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSF8" edc:desc="" edc:mask="0x1" edc:name="ANSF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSF12" edc:desc="" edc:mask="0x1" edc:name="ANSF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSF13" edc:desc="" edc:mask="0x1" edc:name="ANSF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886510" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="TRISF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------11---1--111111" edc:name="TRISF" edc:nzwidth="0x20" edc:por="------------------11---1--111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISF8" edc:desc="" edc:mask="0x1" edc:name="TRISF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISF12" edc:desc="" edc:mask="0x1" edc:name="TRISF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISF13" edc:desc="" edc:mask="0x1" edc:name="TRISF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886520" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="PORTF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx---x--xxxxxx" edc:name="PORTF" edc:nzwidth="0x20" edc:por="------------------xx---x--xxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RF8" edc:desc="" edc:mask="0x1" edc:name="RF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RF12" edc:desc="" edc:mask="0x1" edc:name="RF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RF13" edc:desc="" edc:mask="0x1" edc:name="RF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
